{
  "nodes": [
    {
      "op": "null", 
      "name": "timeFeaturesPred", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "dec_input_seq", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "5", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "repeat754", 
      "attrs": {
        "axis": "0", 
        "repeats": "100"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "itemFeatures", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "item_features_categorical_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "1", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "embed_0_weight", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "item_embed_0", 
      "attrs": {
        "input_dim": "1", 
        "output_dim": "10"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "item_inputs_embed", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "trainTarget", 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims6", 
      "attrs": {"axis": "2"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "trainTarget_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "749", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat56", 
      "attrs": {
        "dim": "1", 
        "num_args": "20"
      }, 
      "inputs": [
        [10, 729, 0], 
        [10, 730, 0], 
        [10, 731, 0], 
        [10, 732, 0], 
        [10, 733, 0], 
        [10, 734, 0], 
        [10, 735, 0], 
        [10, 736, 0], 
        [10, 737, 0], 
        [10, 738, 0], 
        [10, 739, 0], 
        [10, 740, 0], 
        [10, 741, 0], 
        [10, 742, 0], 
        [10, 743, 0], 
        [10, 744, 0], 
        [10, 745, 0], 
        [10, 746, 0], 
        [10, 747, 0], 
        [10, 748, 0]
      ]
    }, 
    {
      "op": "abs", 
      "name": "abs1", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "observedValuesTrain", 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims9", 
      "attrs": {"axis": "2"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "observedValuesTrain_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "749", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat57", 
      "attrs": {
        "dim": "1", 
        "num_args": "20"
      }, 
      "inputs": [
        [15, 729, 0], 
        [15, 730, 0], 
        [15, 731, 0], 
        [15, 732, 0], 
        [15, 733, 0], 
        [15, 734, 0], 
        [15, 735, 0], 
        [15, 736, 0], 
        [15, 737, 0], 
        [15, 738, 0], 
        [15, 739, 0], 
        [15, 740, 0], 
        [15, 741, 0], 
        [15, 742, 0], 
        [15, 743, 0], 
        [15, 744, 0], 
        [15, 745, 0], 
        [15, 746, 0], 
        [15, 747, 0], 
        [15, 748, 0]
      ]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul381", 
      "inputs": [[12, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum3", 
      "attrs": {"axis": "1"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum2", 
      "attrs": {"axis": "1"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like71", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "broadcast_greater", 
      "name": "broadcast_greater1", 
      "inputs": [[18, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like102", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "broadcast_maximum", 
      "name": "broadcast_maximum1", 
      "inputs": [[19, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div26", 
      "inputs": [[18, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like103", 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar76", 
      "attrs": {"scalar": "34497.42622950819"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where226", 
      "inputs": [[21, 0, 0], [24, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar1", 
      "attrs": {"scalar": "1e-10"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(-1,)"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims11", 
      "attrs": {"axis": "1"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log51", 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat58", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[7, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "repeat755", 
      "attrs": {
        "axis": "0", 
        "repeats": "100"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "isPaddedTrain", 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims8", 
      "attrs": {"axis": "2"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "isPaddedTrain_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "749", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like131", 
      "inputs": [[10, 748, 0]]
    }, 
    {
      "op": "null", 
      "name": "timeFeaturesTrain", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "enc_input_seq", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "749", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like128", 
      "inputs": [[10, 747, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like125", 
      "inputs": [[10, 746, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like122", 
      "inputs": [[10, 745, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like119", 
      "inputs": [[10, 744, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like116", 
      "inputs": [[10, 743, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like113", 
      "inputs": [[10, 742, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like110", 
      "inputs": [[10, 741, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like107", 
      "inputs": [[10, 740, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like104", 
      "inputs": [[10, 739, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like101", 
      "inputs": [[10, 738, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like98", 
      "inputs": [[10, 737, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like95", 
      "inputs": [[10, 736, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like92", 
      "inputs": [[10, 735, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like89", 
      "inputs": [[10, 734, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like86", 
      "inputs": [[10, 733, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like83", 
      "inputs": [[10, 732, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like80", 
      "inputs": [[10, 731, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like77", 
      "inputs": [[10, 730, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like74", 
      "inputs": [[10, 729, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat59", 
      "attrs": {
        "dim": "1", 
        "num_args": "27"
      }, 
      "inputs": [
        [10, 728, 0], 
        [10, 727, 0], 
        [10, 726, 0], 
        [10, 725, 0], 
        [10, 724, 0], 
        [10, 723, 0], 
        [10, 722, 0], 
        [10, 721, 0], 
        [10, 716, 0], 
        [10, 715, 0], 
        [10, 714, 0], 
        [10, 709, 0], 
        [10, 708, 0], 
        [10, 707, 0], 
        [10, 702, 0], 
        [10, 701, 0], 
        [10, 700, 0], 
        [10, 699, 0], 
        [10, 698, 0], 
        [10, 673, 0], 
        [10, 645, 0], 
        [10, 366, 0], 
        [10, 365, 0], 
        [10, 364, 0], 
        [10, 2, 0], 
        [10, 1, 0], 
        [10, 0, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div27", 
      "inputs": [[59, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat60", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 729, 0], [32, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0i2h_bias", 
      "attrs": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t0_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_0begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 40)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where227", 
      "inputs": [[36, 729, 0], [65, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t0_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus100", 
      "inputs": [[64, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[71, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[71, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_0begin_state_1", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 40)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where228", 
      "inputs": [[36, 729, 0], [74, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul382", 
      "inputs": [[73, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[71, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul383", 
      "inputs": [[77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t0_state", 
      "inputs": [[76, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation100", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t0_out", 
      "inputs": [[72, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1i2h_bias", 
      "attrs": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t0_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_1begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 40)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where229", 
      "inputs": [[36, 729, 0], [86, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t0_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus101", 
      "inputs": [[85, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[92, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[92, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_1begin_state_1", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 40)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where230", 
      "inputs": [[36, 729, 0], [95, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul384", 
      "inputs": [[94, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[92, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul385", 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t0_state", 
      "inputs": [[97, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation101", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t0_out", 
      "inputs": [[93, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t0_out_plus_residual", 
      "inputs": [[103, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mu_Noneproj_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mu_Noneproj_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected75", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul392", 
      "inputs": [[107, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where235", 
      "inputs": [[36, 729, 0], [58, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where236", 
      "inputs": [[15, 729, 0], [10, 729, 0], [109, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat61", 
      "attrs": {
        "dim": "1", 
        "num_args": "27"
      }, 
      "inputs": [
        [110, 0, 0], 
        [10, 728, 0], 
        [10, 727, 0], 
        [10, 726, 0], 
        [10, 725, 0], 
        [10, 724, 0], 
        [10, 723, 0], 
        [10, 722, 0], 
        [10, 717, 0], 
        [10, 716, 0], 
        [10, 715, 0], 
        [10, 710, 0], 
        [10, 709, 0], 
        [10, 708, 0], 
        [10, 703, 0], 
        [10, 702, 0], 
        [10, 701, 0], 
        [10, 700, 0], 
        [10, 699, 0], 
        [10, 674, 0], 
        [10, 646, 0], 
        [10, 367, 0], 
        [10, 366, 0], 
        [10, 365, 0], 
        [10, 3, 0], 
        [10, 2, 0], 
        [10, 1, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div28", 
      "inputs": [[111, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat62", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 730, 0], [32, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t1_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[113, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like104", 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout100", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where231", 
      "inputs": [[116, 0, 0], [82, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where237", 
      "inputs": [[36, 730, 0], [65, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t1_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[118, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus104", 
      "inputs": [[114, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[121, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[121, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like105", 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout101", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where232", 
      "inputs": [[125, 0, 0], [80, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where238", 
      "inputs": [[36, 730, 0], [74, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul397", 
      "inputs": [[123, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[121, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul398", 
      "inputs": [[129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t1_state", 
      "inputs": [[128, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation104", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t1_out", 
      "inputs": [[122, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t1_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[134, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like106", 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout102", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where233", 
      "inputs": [[137, 0, 0], [103, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where239", 
      "inputs": [[36, 730, 0], [86, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t1_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[139, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus105", 
      "inputs": [[135, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[142, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[142, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like107", 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout103", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where234", 
      "inputs": [[146, 0, 0], [101, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where240", 
      "inputs": [[36, 730, 0], [95, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul399", 
      "inputs": [[144, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[142, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul400", 
      "inputs": [[150, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t1_state", 
      "inputs": [[149, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation105", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t1_out", 
      "inputs": [[143, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t1_out_plus_residual", 
      "inputs": [[155, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected78", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[156, 0, 0], [105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul407", 
      "inputs": [[157, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where245", 
      "inputs": [[36, 730, 0], [57, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where246", 
      "inputs": [[15, 730, 0], [10, 730, 0], [159, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat63", 
      "attrs": {
        "dim": "1", 
        "num_args": "27"
      }, 
      "inputs": [
        [160, 0, 0], 
        [110, 0, 0], 
        [10, 728, 0], 
        [10, 727, 0], 
        [10, 726, 0], 
        [10, 725, 0], 
        [10, 724, 0], 
        [10, 723, 0], 
        [10, 718, 0], 
        [10, 717, 0], 
        [10, 716, 0], 
        [10, 711, 0], 
        [10, 710, 0], 
        [10, 709, 0], 
        [10, 704, 0], 
        [10, 703, 0], 
        [10, 702, 0], 
        [10, 701, 0], 
        [10, 700, 0], 
        [10, 675, 0], 
        [10, 647, 0], 
        [10, 368, 0], 
        [10, 367, 0], 
        [10, 366, 0], 
        [10, 4, 0], 
        [10, 3, 0], 
        [10, 2, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div29", 
      "inputs": [[161, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat64", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 731, 0], [32, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t2_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[163, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like108", 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout104", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where241", 
      "inputs": [[166, 0, 0], [134, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where247", 
      "inputs": [[36, 731, 0], [65, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t2_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[168, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus108", 
      "inputs": [[164, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t2_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[171, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[171, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like109", 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout105", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where242", 
      "inputs": [[175, 0, 0], [132, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where248", 
      "inputs": [[36, 731, 0], [74, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul412", 
      "inputs": [[173, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[171, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul413", 
      "inputs": [[179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t2_state", 
      "inputs": [[178, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation108", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t2_out", 
      "inputs": [[172, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t2_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[184, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like110", 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout106", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where243", 
      "inputs": [[187, 0, 0], [155, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where249", 
      "inputs": [[36, 731, 0], [86, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t2_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[189, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus109", 
      "inputs": [[185, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t2_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[192, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[192, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like111", 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout107", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where244", 
      "inputs": [[196, 0, 0], [153, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where250", 
      "inputs": [[36, 731, 0], [95, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul414", 
      "inputs": [[194, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[192, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul415", 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t2_state", 
      "inputs": [[199, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation109", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t2_out", 
      "inputs": [[193, 0, 0], [204, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t2_out_plus_residual", 
      "inputs": [[205, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected81", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[206, 0, 0], [105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul422", 
      "inputs": [[207, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where255", 
      "inputs": [[36, 731, 0], [56, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where256", 
      "inputs": [[15, 731, 0], [10, 731, 0], [209, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat65", 
      "attrs": {
        "dim": "1", 
        "num_args": "27"
      }, 
      "inputs": [
        [210, 0, 0], 
        [160, 0, 0], 
        [110, 0, 0], 
        [10, 728, 0], 
        [10, 727, 0], 
        [10, 726, 0], 
        [10, 725, 0], 
        [10, 724, 0], 
        [10, 719, 0], 
        [10, 718, 0], 
        [10, 717, 0], 
        [10, 712, 0], 
        [10, 711, 0], 
        [10, 710, 0], 
        [10, 705, 0], 
        [10, 704, 0], 
        [10, 703, 0], 
        [10, 702, 0], 
        [10, 701, 0], 
        [10, 676, 0], 
        [10, 648, 0], 
        [10, 369, 0], 
        [10, 368, 0], 
        [10, 367, 0], 
        [10, 5, 0], 
        [10, 4, 0], 
        [10, 3, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div30", 
      "inputs": [[211, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat66", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 732, 0], [32, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t3_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[213, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like112", 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout108", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where251", 
      "inputs": [[216, 0, 0], [184, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where257", 
      "inputs": [[36, 732, 0], [65, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t3_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[218, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus112", 
      "inputs": [[214, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t3_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[221, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[221, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like113", 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout109", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where252", 
      "inputs": [[225, 0, 0], [182, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where258", 
      "inputs": [[36, 732, 0], [74, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul427", 
      "inputs": [[223, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[221, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul428", 
      "inputs": [[229, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t3_state", 
      "inputs": [[228, 0, 0], [231, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation112", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t3_out", 
      "inputs": [[222, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t3_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[234, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like114", 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout110", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[236, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where253", 
      "inputs": [[237, 0, 0], [205, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where259", 
      "inputs": [[36, 732, 0], [86, 0, 0], [238, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t3_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[239, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus113", 
      "inputs": [[235, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t3_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t3_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[242, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t3_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[242, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like115", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout111", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[245, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where254", 
      "inputs": [[246, 0, 0], [203, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where260", 
      "inputs": [[36, 732, 0], [95, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul429", 
      "inputs": [[244, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t3_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t3_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[242, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul430", 
      "inputs": [[250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t3_state", 
      "inputs": [[249, 0, 0], [252, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation113", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[253, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t3_out", 
      "inputs": [[243, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t3_out_plus_residual", 
      "inputs": [[255, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected84", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[256, 0, 0], [105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul437", 
      "inputs": [[257, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where265", 
      "inputs": [[36, 732, 0], [55, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where266", 
      "inputs": [[15, 732, 0], [10, 732, 0], [259, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat67", 
      "attrs": {
        "dim": "1", 
        "num_args": "27"
      }, 
      "inputs": [
        [260, 0, 0], 
        [210, 0, 0], 
        [160, 0, 0], 
        [110, 0, 0], 
        [10, 728, 0], 
        [10, 727, 0], 
        [10, 726, 0], 
        [10, 725, 0], 
        [10, 720, 0], 
        [10, 719, 0], 
        [10, 718, 0], 
        [10, 713, 0], 
        [10, 712, 0], 
        [10, 711, 0], 
        [10, 706, 0], 
        [10, 705, 0], 
        [10, 704, 0], 
        [10, 703, 0], 
        [10, 702, 0], 
        [10, 677, 0], 
        [10, 649, 0], 
        [10, 370, 0], 
        [10, 369, 0], 
        [10, 368, 0], 
        [10, 6, 0], 
        [10, 5, 0], 
        [10, 4, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div31", 
      "inputs": [[261, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat68", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 733, 0], [32, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t4_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[263, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like116", 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout112", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[265, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where261", 
      "inputs": [[266, 0, 0], [234, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where267", 
      "inputs": [[36, 733, 0], [65, 0, 0], [267, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t4_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[268, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus116", 
      "inputs": [[264, 0, 0], [269, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t4_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t4_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[271, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t4_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[271, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like117", 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout113", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where262", 
      "inputs": [[275, 0, 0], [232, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where268", 
      "inputs": [[36, 733, 0], [74, 0, 0], [276, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul442", 
      "inputs": [[273, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t4_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[271, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t4_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[271, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul443", 
      "inputs": [[279, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t4_state", 
      "inputs": [[278, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation116", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t4_out", 
      "inputs": [[272, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t4_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[284, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like118", 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout114", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where263", 
      "inputs": [[287, 0, 0], [255, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where269", 
      "inputs": [[36, 733, 0], [86, 0, 0], [288, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t4_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[289, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus117", 
      "inputs": [[285, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t4_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t4_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[292, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t4_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[292, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like119", 
      "inputs": [[253, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout115", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[295, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where264", 
      "inputs": [[296, 0, 0], [253, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where270", 
      "inputs": [[36, 733, 0], [95, 0, 0], [297, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul444", 
      "inputs": [[294, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t4_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t4_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[292, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul445", 
      "inputs": [[300, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t4_state", 
      "inputs": [[299, 0, 0], [302, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation117", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t4_out", 
      "inputs": [[293, 0, 0], [304, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t4_out_plus_residual", 
      "inputs": [[305, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected87", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[306, 0, 0], [105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul452", 
      "inputs": [[307, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where275", 
      "inputs": [[36, 733, 0], [54, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where276", 
      "inputs": [[15, 733, 0], [10, 733, 0], [309, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat69", 
      "attrs": {
        "dim": "1", 
        "num_args": "27"
      }, 
      "inputs": [
        [310, 0, 0], 
        [260, 0, 0], 
        [210, 0, 0], 
        [160, 0, 0], 
        [110, 0, 0], 
        [10, 728, 0], 
        [10, 727, 0], 
        [10, 726, 0], 
        [10, 721, 0], 
        [10, 720, 0], 
        [10, 719, 0], 
        [10, 714, 0], 
        [10, 713, 0], 
        [10, 712, 0], 
        [10, 707, 0], 
        [10, 706, 0], 
        [10, 705, 0], 
        [10, 704, 0], 
        [10, 703, 0], 
        [10, 678, 0], 
        [10, 650, 0], 
        [10, 371, 0], 
        [10, 370, 0], 
        [10, 369, 0], 
        [10, 7, 0], 
        [10, 6, 0], 
        [10, 5, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div32", 
      "inputs": [[311, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat70", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[39, 734, 0], [32, 0, 0], [312, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t5_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[313, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like120", 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout116", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where271", 
      "inputs": [[316, 0, 0], [284, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where277", 
      "inputs": [[36, 734, 0], [65, 0, 0], [317, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t5_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[318, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus120", 
      "inputs": [[314, 0, 0], [319, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t5_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[320, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t5_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[321, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t5_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[321, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like121", 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout117", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[324, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where272", 
      "inputs": [[325, 0, 0], [282, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where278", 
      "inputs": [[36, 734, 0], [74, 0, 0], [326, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul457", 
      "inputs": [[323, 0, 0], [327, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t5_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[321, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t5_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[321, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul458", 
      "inputs": [[329, 0, 0], [330, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t5_state", 
      "inputs": [[328, 0, 0], [331, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation120", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[332, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t5_out", 
      "inputs": [[322, 0, 0], [333, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t5_i2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[334, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like122", 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout118", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where273", 
      "inputs": [[337, 0, 0], [305, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where279", 
      "inputs": [[36, 734, 0], [86, 0, 0], [338, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t5_h2h", 
      "attrs": {"num_hidden": "160"}, 
      "inputs": [[339, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus121", 
      "inputs": [[335, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t5_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[341, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t5_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[342, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t5_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[342, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like123", 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout119", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[345, 0, 0]]
    }, 
    {
